# Housing Market

### Introduction:

This time we will create our own dataset with fictional numbers to describe a house market. As we are going to create random data don't try to reason of the numbers.

### Step 1. Import the necessary libraries

In [1]:
import numpy as np
import pandas as pd

### Step 2. Create 3 differents Series, each of length 100, as follows: 
1. The first a random number from 1 to 4 
2. The second a random number from 1 to 3
3. The third a random number from 10,000 to 30,000

In [2]:
s1 = pd.Series(np.random.randint(1, 5, size=100), dtype='l')
s2 = pd.Series(np.random.randint(1, 4, size=100), dtype='l')
s3 = pd.Series(np.random.randint(10000, 30000, size=100), dtype='l')

### Step 3. Let's create a DataFrame by joinning the Series by column

In [3]:
df = pd.concat([s1, s2, s3], axis=1)
df.head()

   0  1      2
0  2  3  11983
1  2  1  28801
2  1  1  16082
3  2  3  29444
4  2  1  27164

### Step 4. Change the name of the columns to bedrs, bathrs, price_sqr_meter

In [4]:
df.rename(columns={0:'bedrs', 1:'bathrs', 2:'price_sqr_meter'}, inplace=True)
df.head()

   bedrs  bathrs  price_sqr_meter
0      2       3            11983
1      2       1            28801
2      1       1            16082
3      2       3            29444
4      2       1            27164

### Step 5. Create a one column DataFrame with the values of the 3 Series and assign it to 'bigcolumn'

In [5]:
bigcolumn = pd.concat([s1, s2, s3])

# it is still a Series, so we need to transform it to a DataFrame
bigcolumn = bigcolumn.to_frame()
print(type(bigcolumn))

bigcolumn

<class 'pandas.core.frame.DataFrame'>

        0
0       2
1       2
2       1
3       2
4       2
..    ...
95  27696
96  27928
97  10697
98  12224
99  16275

[300 rows x 1 columns]

### Step 6. Oops, it seems it is going only until index 99. Is it true?

In [6]:
bigcolumn.shape

(300, 1)

### Step 7. Reindex the DataFrame so it goes from 0 to 299

In [7]:
# bigcolumn.reset_index(drop=True, inplace=True)
# bigcolumn.set_index(np.arange(len(bigcolumn)), inplace=True)
bigcolumn.index = np.arange(len(bigcolumn))
bigcolumn

         0
0        2
1        2
2        1
3        2
4        2
..     ...
295  27696
296  27928
297  10697
298  12224
299  16275

[300 rows x 1 columns]